# Conectar Pandas a MySQL y extraer información

# 1) Importar la libreria Pandas y el toolkit SQLAlchemy - mediante el cual se realizará la conexión

In [1]:
import pandas as pd
import sqlalchemy as sql

## 2) Crear una conexión con la BBDD y guardarla en una variable

In [2]:
engine = sql.create_engine('mysql+mysqldb://root:<CONTRASEÑA>@localhost:3306/<NOMBRE DE LA BBDD>')

Reemplazar los campos entre <> por su contraseña de MySQL y el nombre de la base de datos que van a utilizar

## Ejemplo de conexión con la BBDD del taller 8

In [3]:
engine = sql.create_engine('mysql+mysqldb://root:DarkFuneral2018@localhost:3306/taller8_0000168905')

## 3) Leer una tabla de la BBDD

In [4]:
pd.read_sql('Persona', engine)

,idPersona,Nombres,Apellidos,FechaNacimiento,Nacionalidad_idNacionalidad
0,1,Juan,Perez,1975-04-10,1
1,2,Konstantin,Novoselov,1974-08-23,2
2,3,Andre,Geim,1985-10-01,3
3,4,George,Smith,1930-05-10,4
4,5,Willard,Boyle,1924-08-19,5
5,6,Charles,Kao,1933-11-04,6
6,7,Barack,Obama,1961-08-04,4
7,8,Gabriel,García Márquez,1927-03-06,7
8,9,Amartya,Sen,1933-11-03,8
9,10,Gunter,Blobel,1936-05-21,9

pd.read_sql('Nombre de la tabla', engine) -> el parametro engine representa la conexión a la BBDD anterior

## 4) Leer una tabla generada a partir de un query

In [5]:
pd.read_sql_query("SELECT Nacionalidad.nacionalidad, COUNT(Premiado.Premio_idPremio) AS 'Número de premios' FROM Nacionalidad INNER JOIN Persona ON Nacionalidad.idNacionalidad = Persona.Nacionalidad_idNacionalidad LEFT OUTER JOIN Premiado ON Persona.idPersona = Premiado.Persona_idPersona GROUP BY Nacionalidad.nacionalidad", engine)

     nacionalidad  Número de premios
0        Alemania                  1
1          Canadá                  1
2           China                  1
3        Colombia                  1
4  Estados Unidos                  2
5         Holanda                  1
6           India                  1
7            Perú                  0
8           Rusia                  1

pd.read_sql_query("query", engine) -> Marcar el query con comillas dobles " " para evitar problemas con las comillas sencillas ' ' que se usan dentro del querie y dejar todo el query dentro de una sola linea sin importar que tan largo sea

### Si el query requiere el uso de % ponerlo dos veces seguidas %%

In [6]:
pd.read_sql_query("SELECT CONCAT(Persona.nombres, ' ', Persona.apellidos) AS Nombre, Persona.FechaNacimiento, Nacionalidad.nacionalidad FROM Persona INNER JOIN Nacionalidad ON Persona.Nacionalidad_idNacionalidad = Nacionalidad.idNacionalidad WHERE Persona.nombres LIKE 'G%%' AND Persona.nombres LIKE '%%o%%'", engine)

         Nombre FechaNacimiento    nacionalidad
0  George Smith      1930-05-10  Estados Unidos

## 5) Almacenar resultados en variables

In [7]:
contador = pd.read_sql_query("SELECT Nacionalidad.nacionalidad, COUNT(Premiado.Premio_idPremio) AS 'Número de premios' FROM Nacionalidad INNER JOIN Persona ON Nacionalidad.idNacionalidad = Persona.Nacionalidad_idNacionalidad LEFT OUTER JOIN Premiado ON Persona.idPersona = Premiado.Persona_idPersona GROUP BY Nacionalidad.nacionalidad", engine)

In [8]:
contador

     nacionalidad  Número de premios
0        Alemania                  1
1          Canadá                  1
2           China                  1
3        Colombia                  1
4  Estados Unidos                  2
5         Holanda                  1
6           India                  1
7            Perú                  0
8           Rusia                  1